---
kind: method
id: M:Autodesk.Revit.DB.MultiReferenceAnnotationOptions.#ctor(Autodesk.Revit.DB.MultiReferenceAnnotationType)
source: html/2ffad006-1ef9-8224-bd1e-a0cfcc533d29.htm
---
# Autodesk.Revit.DB.MultiReferenceAnnotationOptions.#ctor Method

Create an instance of Multi-Reference Annotation Options set with default values.

## Syntax (C#)
```csharp
public MultiReferenceAnnotationOptions(
	MultiReferenceAnnotationType multiReferenceAnnotationType
)
```

## Parameters
- **multiReferenceAnnotationType** (`Autodesk.Revit.DB.MultiReferenceAnnotationType`) - The MultiReferenceAnnotationType to be used by the new MultiReferenceAnnotation.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null